namespace Game.dialoges{
    public class Text(){
        public static string zenon(int id){
            string sms;
            switch(id){
                case 1:
                    sms = "Що... що сталося? Все темне... Що я бачу?";
                    return sms;
                case 2:
                    sms = "Я... я бачу лише обриси. Щось рухається в темрявi. Що це? Як я можу розiбратися в цьому?";
                    return sms;
                default:
                    return "Syntax eroor: wrong ID";
            }
        }
        public static string action(int id){
            string sms;
            switch(id){
                case 1:
                    sms = "Зенон Хелкс приходить до тями пiсля катастрофи. На екранi—повна темрява, але з часом його очi починають намагатися фокусуватися. Щось вiн бачить — розмитi контури та тiнi, але зiр все ще серйозно порушений.";
                    return sms;
                case 2:
                    sms = "Зенон намагається встати, але орiєнтується дуже важко. Всi кольори виглядають блякло, а навколишнi об'єкти здаються лише розмитими силуэтами.";
                    return sms;
                case 3:
                    sms = "Зенон важко пiдводиться i починає рухатися по кораблю, намагаючись знайти потрiбнi системи для ремонту. Вiн може \n бачити лише певнi контури, але деталей не вистачає для повної орiєнтацiї.";
                    return sms;
                case 4:
                    sms = "Далеко чути звуки ламаючогося металу. Зенон iнтуїтивно наближається до джерела шуму.";
                    return sms;
                case 5:
                    sms = "Зенон продовжує шукати вихiд з цiєї ситуацiї, використовуючи свої залишковi можливостi бачити обриси, орiєнтуватися на звуки та сенсори. Ще частково залишаються контури планет, якi вiн може бачити через вiкно корабля, але вони дуже розмитi.";
                    return sms;
                default:
                    return "Syntax eroor: wrong ID";
            }
        }
        public static string radio(int id){
            string sms;
            switch(id){
                case 1:
                    sms = "Зеноне, ти в порядку? Ти з нами? Система життєзабезпечення працює, але ми вийшли з орбiти. Зоряний Вихор змiнив" +
                " усi навколишнi поля. Це не просто аномалiя... твої органи зору, схоже, теж пошкодженi.";
                    return sms;
                case 2:
                    sms = "Це корабель, Зенон. Вiн зламаний. Ти маєш обережно рухатися по борту, бо частина корабля вже руйнується. У тебе є лише обмежена кiлькiсть часу, щоб знайти ресурси та забезпечити безпеку.";
                    return sms;
                default:
                    return "Syntax eroor: wrong ID";
            }
        }
    }
}